app/controllers/matches_controller.rb

SELECT `matches`.* FROM `matches` WHERE `matches`.`id` = 1 LIMIT 1
UPDATE `matches` SET `date` = 'today', `updated_at` = '2014-11-18 14:25:43' WHERE `matches`.`id` = 1
---
  def update
    match_params = params.permit(:id, :team1, :team2, :place, :date, :price)
    @match = Match.find(params[:id])
    @match.update_attributes!(match_params)